package com.dream.pay.center.common.enums;

/**
 * 币种枚举
 * <p>
 * Created by mengzhenbin on 17/9/22.
 */
public enum CurrencyCode {

    /**
     * 币种
     */
    ALL("008", "ALL", "2", "列克"),

    /**
     * 币种
     */
    DZD("012", "DZD", "2", "第纳尔"),

    /**
     * 币种
     */
    ARS("032", "ARS", "2", "阿根廷比索"),

    /**
     * 币种
     */
    AUD("036", "AUD", "2", "澳元"),

    /**
     * 币种
     */
    BSD("044", "BSD", "2", "巴哈马元"),

    /**
     * 币种
     */
    BHD("048", "BHD", "3", "第纳尔"),

    /**
     * 币种
     */
    BDT("050", "BDT", "2", "塔卡"),

    /**
     * 币种
     */
    AMD("051", "AMD", "2", "德拉姆"),

    /**
     * 币种
     */
    BBD("052", "BBD", "2", "巴巴多斯元"),

    /**
     * 币种
     */
    BMD("060", "BMD", "2", "百慕大元"),

    /**
     * 币种
     */
    BOB("068", "BOB", "2", "玻利瓦诺"),

    /**
     * 币种
     */
    BWP("072", "BWP", "2", "普拉"),

    /**
     * 币种
     */
    BZD("084", "BZD", "2", "伯利兹元"),

    /**
     * 币种
     */
    SBD("090", "SBD", "2", "所罗门群岛元"),

    /**
     * 币种
     */
    BND("096", "BND", "2", "文莱元"),

    /**
     * 币种
     */
    BIF("108", "BIF", "2", "法郎"),

    /**
     * 币种
     */
    KHR("116", "KHR", "2", "瑞尔"),

    /**
     * 币种
     */
    CAD("124", "CAD", "2", "加拿大元"),

    /**
     * 币种
     */
    CVE("132", "CVE", "2", "埃斯库多"),

    /**
     * 币种
     */
    KYD("136", "KYD", "2", "开曼群岛元"),

    /**
     * 币种
     */
    LKR("144", "LKR", "2", "卢比"),

    /**
     * 币种
     */
    CLP("152", "CLP", "2", "智利比索"),

    /**
     * 币种
     */
    CNY("156", "CNY", "2", "人民币"),
    /**
     * 币种
     */
    COP("170", "COP", "2", "哥伦比亚比索"),
    /**
     * 币种
     */
    KMF("174", "KMF", "0", "法郎"),
    /**
     * 币种
     */
    CRC("188", "CRC", "2", "科朗"),
    /**
     * 币种
     */
    HRK("191", "HRK", "2", "库纳"),
    /**
     * 币种
     */
    CZK("203", "CZK", "2", "克朗"),
    /**
     * 币种
     */
    DKK("208", "DKK", "2", "克朗"),
    /**
     * 币种
     */
    DOP("214", "DOP", "2", "多米尼加比索"),
    /**
     * 币种
     */
    ETB("230", "ETB", "2", "比尔"),
    /**
     * 币种
     */
    ERN("232", "ERN", "2", "纳克法"),
    /**
     * 币种
     */
    FKP("238", "FKP", "2", "法克兰镑"),
    /**
     * 币种
     */
    FJD("242", "FJD", "2", "斐济元"),
    /**
     * 币种
     */
    DJF("262", "DJF", "0", "法郎"),
    /**
     * 币种
     */
    GMD("270", "GMD", "2", "达拉西"),
    /**
     * 币种
     */
    GIP("292", "GIP", "2", "直布罗陀镑"),
    /**
     * 币种
     */
    GTQ("320", "GTQ", "2", "格查尔"),
    /**
     * 币种
     */
    GYD("328", "GYD", "2", "圭亚那元"),
    /**
     * 币种
     */
    HTG("332", "HTG", "2", "古德"),
    /**
     * 币种
     */
    HNL("340", "HNL", "2", "伦皮拉"),
    /**
     * 币种
     */
    HKD("344", "HKD", "2", "港元"),
    /**
     * 币种
     */
    HUF("348", "HUF", "2", "福林"),
    /**
     * 币种
     */
    ISK("352", "ISK", "2", "克朗"),
    /**
     * 币种
     */
    INR("356", "INR", "2", "卢比"),
    /**
     * 币种
     */
    IDR("360", "IDR", "0", "印尼盾"),
    /**
     * 币种
     */
    IQD("368", "IQD", "3", "第纳尔"),
    /**
     * 币种
     */
    ILS("376", "ILS", "2", "新谢克尔"),
    /**
     * 币种
     */
    JMD("388", "JMD", "2", "牙买加元"),
    /**
     * 币种
     */
    JPY("392", "JPY", "0", "日元"),
    /**
     * 币种
     */
    KZT("398", "KZT", "2", "坚戈"),
    /**
     * 币种
     */
    JOD("400", "JOD", "3", "第纳尔"),
    /**
     * 币种
     */
    KES("404", "KES", "2", "先令"),
    /**
     * 币种
     */
    KRW("410", "KRW", "0", "韩元"),
    /**
     * 币种
     */
    KWD("414", "KWD", "3", "第纳尔"),
    /**
     * 币种
     */
    KGS("417", "KGS", "2", "索姆"),
    /**
     * 币种
     */
    LAK("418", "LAK", "2", "基普"),
    /**
     * 币种
     */
    LBP("422", "LBP", "2", "黎巴嫩镑"),
    /**
     * 币种
     */
    LSL("426", "LSL", "2", "马洛蒂"),
    /**
     * 币种
     */
    LVL("428", "LVL", "2", "拉特"),
    /**
     * 币种
     */
    LRD("430", "LRD", "2", "利比里亚元"),
    /**
     * 币种
     */
    LTL("440", "LTL", "2", "立特"),
    /**
     * 币种
     */
    MOP("446", "MOP", "2", "澳门元"),
    /**
     * 币种
     */
    MWK("454", "MWK", "2", "客瓦查"),
    /**
     * 币种
     */
    MYR("458", "MYR", "2", "令吉"),
    /**
     * 币种
     */
    MVR("462", "MVR", "2", "拉菲亚"),
    /**
     * 币种
     */
    MRO("478", "MRO", "2", "乌吉亚"),
    /**
     * 币种
     */
    MUR("480", "MUR", "2", "卢比"),
    /**
     * 币种
     */
    MXN("484", "MXN", "2", "墨西哥比索"),
    /**
     * 币种
     */
    MNT("496", "MNT", "2", "图格里克"),
    /**
     * 币种
     */
    MDL("498", "MDL", "2", "列伊"),
    /**
     * 币种
     */
    MAD("504", "MAD", "2", "迪拉姆"),
    /**
     * 币种
     */
    OMR("512", "OMR", "3", "里亚尔"),
    /**
     * 币种
     */
    NAD("516", "NAD", "2", "纳米比亚元"),
    /**
     * 币种
     */
    NPR("524", "NPR", "2", "卢比"),
    /**
     * 币种
     */
    ANG("532", "ANG", "2", "荷属安的列斯盾"),
    /**
     * 币种
     */
    AWG("533", "AWG", "2", "阿鲁巴弗罗林"),
    /**
     * 币种
     */
    VUV("548", "VUV", "0", "瓦图"),
    /**
     * 币种
     */
    NZD("554", "NZD", "2", "新西兰元"),
    /**
     * 币种
     */
    NIO("558", "NIO", "2", "新科多巴"),
    /**
     * 币种
     */
    NGN("566", "NGN", "2", "奈拉"),
    /**
     * 币种
     */
    NOK("578", "NOK", "2", "克朗"),
    /**
     * 币种
     */
    PKR("586", "PKR", "2", "卢比"),
    /**
     * 币种
     */
    PAB("590", "PAB", "2", "巴波亚"),
    /**
     * 币种
     */
    PGK("598", "PGK", "2", "基那"),
    /**
     * 币种
     */
    PYG("600", "PYG", "0", "瓜拉尼"),
    /**
     * 币种
     */
    PEN("604", "PEN", "2", "索尔"),
    /**
     * 币种
     */
    PHP("608", "PHP", "2", "比索"),
    /**
     * 币种
     */
    GWP("624", "GWP", "2", "几内亚比索"),
    /**
     * 币种
     */
    QAR("634", "QAR", "2", "里亚尔"),
    /**
     * 币种
     */
    RUB("643", "RUB", "2", "卢布"),
    /**
     * 币种
     */
    RWF("646", "RWF", "0", "法郎"),
    /**
     * 币种
     */
    SHP("654", "SHP", "2", "圣赫勒拿镑"),
    /**
     * 币种
     */
    STD("678", "STD", "2", "多布拉"),
    /**
     * 币种
     */
    SAR("682", "SAR", "2", "沙特里亚尔"),
    /**
     * 币种
     */
    SCR("690", "SCR", "2", "卢比"),
    /**
     * 币种
     */
    SLL("694", "SLL", "2", "利昂"),
    /**
     * 币种
     */
    SGD("702", "SGD", "2", "新加坡元"),
    /**
     * 币种
     */
    VND("704", "VND", "2", "越南盾"),
    /**
     * 币种
     */
    SOS("706", "SOS", "2", "先令"),
    /**
     * 币种
     */
    ZAR("710", "ZAR", "2", "兰特"),
    /**
     * 币种
     */
    SZL("748", "SZL", "2", "埃马兰吉尼"),
    /**
     * 币种
     */
    SEK("752", "SEK", "2", "克朗"),
    /**
     * 币种
     */
    CHF("756", "CHF", "2", "法郎"),
    /**
     * 币种
     */
    SYP("760", "SYP", "2", "叙利亚镑"),
    /**
     * 币种
     */
    THB("764", "THB", "2", "泰铢"),
    /**
     * 币种
     */
    TOP("776", "TOP", "2", "潘加"),
    /**
     * 币种
     */
    TTD("780", "TTD", "2", "特立尼达和多巴哥元"),
    /**
     * 币种
     */
    AED("784", "AED", "2", "迪拉姆"),
    /**
     * 币种
     */
    TND("788", "TND", "3", "第纳尔"),
    /**
     * 币种
     */
    UGX("800", "UGX", "2", "先令"),
    /**
     * 币种
     */
    MKD("807", "MKD", "2", "德纳尔"),
    /**
     * 币种
     */
    EGP("818", "EGP", "2", "埃及镑"),
    /**
     * 币种
     */
    GBP("826", "GBP", "2", "英镑"),
    /**
     * 币种
     */
    TZS("834", "TZS", "2", "先令"),
    /**
     * 币种
     */
    USD("840", "USD", "2", "美元"),
    /**
     * 币种
     */
    UYU("858", "UYU", "2", "乌拉圭比索"),
    /**
     * 币种
     */
    UZS("860", "UZS", "2", "索姆"),
    /**
     * 币种
     */
    WST("882", "WST", "2", "塔拉"),
    /**
     * 币种
     */
    YER("886", "YER", "2", "里亚尔"),
    /**
     * 币种
     */
    ZMK("894", "ZMK", "2", "克瓦查"),
    /**
     * 币种
     */
    TWD("901", "TWD", "2", "新台币"),
    /**
     * 币种
     */
    TMT("934", "TMT", "2", "土库曼斯坦新马纳特"),
    /**
     * 币种
     */
    GHS("936", "GHS", "2", "加纳塞地"),
    /**
     * 币种
     */
    VEF("937", "VEF", "2", "委内瑞拉波利瓦"),
    /**
     * 币种
     */
    RSD("941", "RSD", "2", "塞尔维亚第纳尔"),
    /**
     * 币种
     */
    MZN("943", "MZN", "2", "新梅蒂卡尔"),
    /**
     * 币种
     */
    AZN("944", "AZN", "2", "马纳特"),
    /**
     * 币种
     */
    RON("946", "RON", "2", "新列伊"),
    /**
     * 币种
     */
    TRY("949", "TRY", "2", "新里拉"),
    /**
     * 币种
     */
    XAF("950", "XAF", "0", "中非法郎"),
    /**
     * 币种
     */
    XCD("951", "XCD", "2", "东加勒比元"),
    /**
     * 币种
     */
    XOF("952", "XOF", "0", "西非法郎"),
    /**
     * 币种
     */
    XPF("953", "XPF", "0", "太平洋法郎"),
    /**
     * 币种
     */
    SRD("968", "SRD", "2", "苏里南元"),
    /**
     * 币种
     */
    MGA("969", "MGA", "2", "阿里亚里"),
    /**
     * 币种
     */
    AFN("971", "AFN", "2", "阿富汗尼"),
    /**
     * 币种
     */
    TJS("972", "TJS", "2", "索莫尼"),
    /**
     * 币种
     */
    AOA("973", "AOA", "2", "宽扎"),
    /**
     * 币种
     */
    BYR("974", "BYR", "0", "卢布"),
    /**
     * 币种
     */
    BGN("975", "BGN", "2", "列弗"),
    /**
     * 币种
     */
    CDF("976", "CDF", "2", "法郎"),
    /**
     * 币种
     */
    BAM("977", "BAM", "2", "波黑货币"),
    /**
     * 币种
     */
    EUR("978", "EUR", "2", "欧元"),
    /**
     * 币种
     */
    UAH("980", "UAH", "2", "格里夫纳"),
    /**
     * 币种
     */
    GEL("981", "GEL", "2", "拉里"),
    /**
     * 币种
     */
    PLN("985", "PLN", "2", "兹罗提"),
    /**
     * 币种
     */
    BRL("986", "BRL", "2", "巴西雷阿尔"),;

    /**
     * 数字形式
     */
    private String num;

    /**
     * 字母形式
     */
    private String alpha;

    /**
     * 币种精度
     */
    private String exponent;

    /**
     * 中文描述
     */
    private String desc;

    /**
     * 构造方法
     *
     * @param num      对应的num值
     * @param alpha    对应的alpha值
     * @param exponent 对应的exponent值
     */
    private CurrencyCode(String num, String alpha, String exponent, String desc) {
        this.num = num;
        this.alpha = alpha;
        this.exponent = exponent;
        this.desc = desc;
    }

    public String getNum() {
        return num;
    }

    public String getAlpha() {
        return alpha;
    }

    public String getExponent() {
        return exponent;
    }

    public String getDesc() {
        return desc;
    }

    /**
     * 根据数字币种获取枚举
     *
     * @param num 对应的num值
     * @return CurrencyCode
     */
    public static CurrencyCode getEnumByNum(String num) {
        for (CurrencyCode currencyCode : CurrencyCode.values()) {
            if (currencyCode.getNum().equalsIgnoreCase(num)) {
                return currencyCode;
            }
        }
        return null;
    }

    /**
     * 根据字母币种获取枚举
     *
     * @param alpha 对应的alpha值
     * @return CurrencyCode
     */
    public static CurrencyCode getEnumByAlpha(String alpha) {
        for (CurrencyCode currencyCode : CurrencyCode.values()) {
            if (currencyCode.getAlpha().equalsIgnoreCase(alpha)) {
                return currencyCode;
            }
        }
        return null;
    }

}
